= Hello World =

Text here.

// hide
// setup
[[init]]
[source,cypher]
----
CREATE (n:Person {name:"Adam"})
RETURN n;
----

[source,querytest]
----
Adam
1 row
Nodes created: 1
Properties set: 1
----

// table

// graph

Let's find the node we created:

// output
[source,json,role=parameters]
----
{
  "name": "Adam"
}
----

[source,cypher]
----
MATCH (person:Person)
WHERE person.name = {name}
RETURN person;
----

[source,querytest]
----
Adam
1 row
----

//profile

//graph_result

[source,sql]
----
VALUES(0)
----

// sqltable

[[my-id]]
== Second level heading

