= Hello World =

Text here.

// hide
// setup
[[init]]
[source,cypher]
----
CREATE (n:Person {name:"Adam"})
RETURN n;
----

////
Adam
1 row
Nodes created: 1
Properties set: 1
////

// table

// graph

Let's find the node we created:

// output
[source,cypher]
----
MATCH (person:Person)
WHERE person.name = "Adam"
RETURN person;
----

////
Adam
1 row
////

